# ElectricalLoads Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
GroupTypeId..::..ElectricalLoads Property
GroupTypeId Class See Also
---
Electrical - Loads.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public static ForgeTypeId ElectricalLoads { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ElectricalLoads As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ElectricalLoads {
	ForgeTypeId^ get ();
}
```

# See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace